RAN_1D/channelFlow395K_EPSLS1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          0.5;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

//output yplus, min/maxU
functions
{
    #includeFunc "writeCellCentres"
    #includeFunc "wallShearStress"
    #includeFunc residuals
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        patches         (lowerWall);
        writeControl    writeTime;
    }

}

// ************************************************************************* //
