RAN_1D/channelFlow395K_EPSLS1D/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
80
(
(0.05 0.00248041 0.05)
(0.05 0.00772218 0.05)
(0.05 0.0135577 0.05)
(0.05 0.0200541 0.05)
(0.05 0.0272863 0.05)
(0.05 0.0353377 0.05)
(0.05 0.044301 0.05)
(0.05 0.0542795 0.05)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    bottom
    {
        type            calculated;
        value           uniform (0.05 0 0.05);
    }
    top
    {
        type            calculated;
        value           uniform (0.05 2 0.05);
    }
    front
    {
        type            cyclic;
    }
    Back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
